#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.amazon_ami: Reading...
aws_iam_role_policy_attachment.custom: Refreshing state... [id=ec2_role-20230822173207480600000001]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2_profile]
aws_vpc.this: Refreshing state... [id=vpc-072241aef51ffc0c2]
aws_eip.nat_gateway[2]: Refreshing state... [id=eipalloc-001b6c6497b76b6bd]
data.aws_iam_policy_document.assume_role: Reading...
data.aws_availability_zones.available: Reading...
aws_iam_role.ec2_role: Refreshing state... [id=ec2_role]
aws_eip.nat_gateway[0]: Refreshing state... [id=eipalloc-085d2323fff304c09]
aws_eip.nat_gateway[1]: Refreshing state... [id=eipalloc-0a4c4beaf16b74826]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2717921857]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-2]
data.aws_ami.amazon_ami: Read complete after 1s [id=ami-0ec5c7d8262c1f6b2]
aws_lb_target_group.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-3-front/f621d46f8a175400]
aws_subnet.private[2]: Refreshing state... [id=subnet-019229fb390591ef1]
aws_subnet.private[1]: Refreshing state... [id=subnet-099f9b370831ba649]
aws_route_table.public: Refreshing state... [id=rtb-0df4f413f90562195]
aws_subnet.private[0]: Refreshing state... [id=subnet-0dc635904472e6cfb]
aws_subnet.public[0]: Refreshing state... [id=subnet-0d2950e2d0755f3f4]
aws_route_table.private[0]: Refreshing state... [id=rtb-04b3e30fb30facbbe]
aws_route_table.private[1]: Refreshing state... [id=rtb-0cdd8670fb360891e]
aws_route_table.private[2]: Refreshing state... [id=rtb-08f41d59494e550f6]
aws_internet_gateway.this-igw: Refreshing state... [id=igw-0a52c1eae25b80e99]
aws_security_group.asg_lb_security_group: Refreshing state... [id=sg-061d54b0e950ec492]
aws_subnet.public[1]: Refreshing state... [id=subnet-0b25032cf5b3b17c0]
aws_subnet.public[2]: Refreshing state... [id=subnet-07b35b103c1cf138a]
aws_default_security_group.default: Refreshing state... [id=sg-00b9f15aac4a6e467]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba1cb840e7e76e68]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-05034b439886cae27]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00fee92b3f124788a]
aws_security_group.ec2_security_group: Refreshing state... [id=sg-056a63e1be280d536]
aws_route.internet-route: Refreshing state... [id=r-rtb-0df4f413f905621951080289494]
aws_lb.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-3/b6fcb7717b0e10b9]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-01da4af5be80a9253]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04de0bd36ef90afca]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a9da232e2f0f6bbf]
aws_nat_gateway.public[0]: Refreshing state... [id=nat-06373bfebc35bb7c9]
aws_nat_gateway.public[1]: Refreshing state... [id=nat-03a732e1da87fba2e]
aws_nat_gateway.public[2]: Refreshing state... [id=nat-03d7dd6c7339f90bf]
aws_launch_template.application: Refreshing state... [id=lt-0b42f30db45bc430c]
aws_route.private-route[2]: Refreshing state... [id=r-rtb-08f41d59494e550f61080289494]
aws_route.private-route[0]: Refreshing state... [id=r-rtb-04b3e30fb30facbbe1080289494]
aws_route.private-route[1]: Refreshing state... [id=r-rtb-0cdd8670fb360891e1080289494]
aws_autoscaling_group.application: Refreshing state... [id=app-3]
aws_lb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-3/b6fcb7717b0e10b9/898672921ea1792b]
aws_autoscaling_attachment.attach-app: Refreshing state... [id=app-3-20230822190800298600000001]
aws_autoscaling_policy.asg_policy_up: Refreshing state... [id=asg_policy_up]
aws_autoscaling_policy.asg_policy_down: Refreshing state... [id=asg_policy_down]
aws_cloudwatch_metric_alarm.asg_cpu_alarm_up: Refreshing state... [id=asg_cpu_alarm_up]
aws_cloudwatch_metric_alarm.asg_cpu_alarm_down: Refreshing state... [id=asg_cpu_alarm_down]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.vpc_flowlog_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_flowlog_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_autoscaling_attachment.attach-app will be created
  + resource "aws_autoscaling_attachment" "attach-app" {
      + autoscaling_group_name = "app-3"
      + id                     = (known after apply)
      + lb_target_group_arn    = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-3-front/f621d46f8a175400"
    }

  # aws_cloudwatch_log_group.cw_loggroup will be created
  + resource "aws_cloudwatch_log_group" "cw_loggroup" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "app-3-log-group"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
    }

  # aws_flow_log.app1 will be created
  + resource "aws_flow_log" "app1" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-072241aef51ffc0c2"
    }

  # aws_iam_instance_profile.ec2_profile will be destroyed
  # (because aws_iam_instance_profile.ec2_profile is not in configuration)
  - resource "aws_iam_instance_profile" "ec2_profile" {
      - arn         = "arn:aws:iam::743794601996:instance-profile/ec2_profile" -> null
      - create_date = "2023-08-22T17:32:08Z" -> null
      - id          = "ec2_profile" -> null
      - name        = "ec2_profile" -> null
      - path        = "/" -> null
      - role        = "ec2_role" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        } -> null
      - unique_id   = "AIPA22LM46AGO25AQXK2Y" -> null
    }

  # aws_iam_role.ec2_role will be destroyed
  # (because aws_iam_role.ec2_role is not in configuration)
  - resource "aws_iam_role" "ec2_role" {
      - arn                   = "arn:aws:iam::743794601996:role/ec2_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-08-22T17:32:08Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ec2_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ec2_role" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-08-22T19:50:25Z"
              - region         = "us-east-2"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        } -> null
      - unique_id             = "AROA22LM46AGMLVEIKQA3" -> null
    }

  # aws_iam_role.vpc_flowlog_role will be created
  + resource "aws_iam_role" "vpc_flowlog_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vpc_flowlog_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.vpc_flowlog_role will be created
  + resource "aws_iam_role_policy" "vpc_flowlog_role" {
      + id     = (known after apply)
      + name   = "vpc_flowlog_role"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.custom will be destroyed
  # (because aws_iam_role_policy_attachment.custom is not in configuration)
  - resource "aws_iam_role_policy_attachment" "custom" {
      - id         = "ec2_role-20230822173207480600000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - role       = "ec2_role" -> null
    }

  # aws_launch_template.application will be updated in-place
  ~ resource "aws_launch_template" "application" {
        id                      = "lt-0b42f30db45bc430c"
      ~ latest_version          = 3 -> (known after apply)
        name                    = "terraform-20230822173222692600000005"
        tags                    = {}
      ~ user_data               = "IyEvYmluL2Jhc2gKc3VkbyBzdQp5dW0gdXBkYXRlIC15Cnl1bSBpbnN0YWxsIC15IGh0dHBkLng4Nl82NAp5dW0gaW5zdGFsbCAteSBqcQphbWF6b24tbGludXgtZXh0cmFzIGluc3RhbGwgZXBlbCAteQp5dW0gaW5zdGFsbCBzdHJlc3MgLXkKUkVHSU9OX0FWX1pPTkU9YGN1cmwgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvZHluYW1pYy9pbnN0YW5jZS1pZGVudGl0eS9kb2N1bWVudCB8IGpxIC5hdmFpbGFiaWxpdHlab25lIC1yYApzeXN0ZW1jdGwgc3RhcnQgaHR0cGQuc2VydmljZQpzeXN0ZW1jdGwgZW5hYmxlIGh0dHBkLnNlcnZpY2UKZWNobyDigJxIZWxsbyBXb3JsZCBmcm9tICQoaG9zdG5hbWUgLWYpIGZyb20gdGhlIHVwZGF0ZWQgYXZhaWxhYmlsaXR5IHpvbmU6ICRSRUdJT05fQVZfWk9OReKAnSA+IC92YXIvd3d3L2h0bWwvaW5kZXguaHRtbA==" -> "IyEvYmluL2Jhc2gKc3VkbyBzdQp5dW0gdXBkYXRlIC15Cnl1bSBpbnN0YWxsIC15IGh0dHBkLng4Nl82NAp5dW0gaW5zdGFsbCAteSBqcQpSRUdJT05fQVZfWk9ORT1gY3VybCAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9keW5hbWljL2luc3RhbmNlLWlkZW50aXR5L2RvY3VtZW50IHwganEgLmF2YWlsYWJpbGl0eVpvbmUgLXJgCnN5c3RlbWN0bCBzdGFydCBodHRwZC5zZXJ2aWNlCnN5c3RlbWN0bCBlbmFibGUgaHR0cGQuc2VydmljZQplY2hvIOKAnEhlbGxvIFdvcmxkIGZyb20gJChob3N0bmFtZSAtZikgZnJvbSB0aGUgYXZhaWxhYmlsaXR5IHpvbmU6ICRSRUdJT05fQVZfWk9OReKAnSA+IC92YXIvd3d3L2h0bWwvaW5kZXguaHRtbA=="
        # (10 unchanged attributes hidden)

      - iam_instance_profile {
          - name = "ec2_profile" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_route.private-route[0] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-06373bfebc35bb7c9"
        id                     = "r-rtb-04b3e30fb30facbbe1080289494"
      - nat_gateway_id         = "nat-06373bfebc35bb7c9" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_route.private-route[1] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-03a732e1da87fba2e"
        id                     = "r-rtb-0cdd8670fb360891e1080289494"
      - nat_gateway_id         = "nat-03a732e1da87fba2e" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_route.private-route[2] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-03d7dd6c7339f90bf"
        id                     = "r-rtb-08f41d59494e550f61080289494"
      - nat_gateway_id         = "nat-03d7dd6c7339f90bf" -> null
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 4 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*